#language: ru
Функционал: Озон

  Сценарий: Фото

    Когда выбран пункт меню "Электроника"
    Когда выбран подпункт подпункта меню "Зеркальные фотоаппараты"
    Когда выбран производитель фото "Canon"
    Когда выбран производитель фото "Nikon"
    Когда задание минимальной стоимости "25000"

    Тогда добавление в корзину нечетных элементов

    Когда переход в корзину
    Тогда проверка совпадений элементов корзины

    Когда удаление всего из корзины
    Тогда проверка, что корзина пуста

  Сценарий: Телефоны

    Когда выбран пункт меню "Электроника"
    Когда выбран подпункт меню "Телефоны"
    Когда выбран производитель "Apple"
    Когда задание минимальной стоимости "20000"

    Тогда добавление в корзину нечетных элементов

    Когда переход в корзину
    Тогда проверка совпадений элементов корзины

    Когда удаление всего из корзины
    Тогда проверка, что корзина пуста








